material = [
    // Tinkercad3D start
    {
        "name":  "STAR WARS | A-wing",
        "color": "#91CA06",
        "srcImg": "img/methodical_material/17.png",
        "link": "https://drive.google.com/file/d/1p42mOg66QKdnpPaI2IqVG3z_Mrh0k_10/view?usp=sharing",
        "tegs": [
            "3D",
            "Tinkercad",
            "Інформатика",
        ],
        "content": [
            "Покрокова модель побудови бойової авіації A-wing із зоряних війн",
        ]
    },
    {
        "name":  "Гарячі клавіші для Tinkercad 3D",
        "color": "#91CA06",
        "srcImg": "img/methodical_material/18.png",
        "link": "https://drive.google.com/file/d/1zIAeR5Ptxg-0lxTRMMllM2u0AybD9UXm/view?usp=sharing",
        "tegs": [
            "3D",
            "Tinkercad",
            "Інформатика",
        ],
        "content": [
            "Гарчі клавіші англійською та українською мовами, моделюй 3D-об'єкти набагато швидше",
        ]
    },
    // Tinkercad3D end

    // woofJS start
    {
        "name":  "1.1 Зірковий злодій",
        "color": "#9FE2DD",
        "srcImg": "img/methodical_material/19.png",
        "link": "https://drive.google.com/file/d/1qeKwLxUV8KKYVUDDbOCAYk8_AaUq7QJS/view?usp=sharing",
        "tegs": [
            "JavaScript",
            "woofJS",
            "Інформатика",
        ],
        "content": [
            "На цьому занятті ми будемо створювати гру з об'єктом, який зникає і з’являється випадково при кожному натисканні. Спробуйте натиснути на об'єкт якомога більше разів, перш ніж закінчиться час",
        ]
    },
    {
        "name":  "1.2 Яблуневий дощ",
        "color": "#9FE2DD",
        "srcImg": "img/methodical_material/20.png",
        "link": "https://drive.google.com/file/d/1DSAQmOJOszMqY282a2cw7Ejs5XE7DB_6/view?usp=sharing",
        "tegs": [
            "JavaScript",
            "woofJS",
            "Інформатика",
        ],
        "content": [
            "У цьому проекті ми збираємося зробити гру, де персонаж повинен збирати падаючі яблука, перш ніж вони торкнуться землі. Гра буде працювати навіть на мобільному телефоні!",
        ]
    },
    {
        "name":  "1.3 Голодний краб",
        "color": "#9FE2DD",
        "srcImg": "img/methodical_material/21.png",
        "link": "https://drive.google.com/file/d/1pz5Eki7SnfOppyosniKQwgWhPgs_0_Ch/view?usp=sharing",
        "tegs": [
            "JavaScript",
            "woofJS",
            "Інформатика",
        ],
        "content": [
            "Використовуйте клавіші зі стрілками для переміщення краба, щоб він міг вполювати рибку. Спробуйте нагодувати краба якомога більше за 30 секунд!",
        ]
    },
    // woofJS end


    // Blender start
    {
        "name":  "Дерев'яний стіл",
        "color": "#EA7600",
        "srcImg": "img/methodical_material/22.png",
        "link": "https://drive.google.com/file/d/1XJl5KCw3oe-pWSR0AQGURaw1vJCnDEYm/view?usp=sharing",
        "tegs": [
            "3D",
            "Blender",
            "Інформатика",
        ],
        "content": [
            "Покрокова модель побудови дерев'яного солу з викорстанням базових прийомів вирівнювання",
        ]
    },
    // Blender end


    // Unity start
    {
        "name":  "1.1 Запуск 3D платформи для створення ігор",
        "color": "#212B35",
        "srcImg": "img/methodical_material/1.png",
        "link": "https://drive.google.com/file/d/1QuFYdPnSNR5IZ6FkDg2cb9n60RmWccR5/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "На цьому уроці ти створиш свій перший ігровий проект в Unity. Також, ти розмістиш транспортний засіб для гравця, змусиш його рухатись та взаємодіяти з перешкодами. Попрацюєш з камерою, налаштуєш оптимальний вигляд сцени. Протягом цього процесу ти навчишся орієнтуватися в редакторі Unity та будеш впевнено себе почувати в 3D просторі сцени. І наприкінці, ти налаштуєш свій власний макет вікна для редактора Unity.",
        ]
    },
    {
        "name":  "1.2 Давим на педаль",
        "color": "#212B35",
        "srcImg": "img/methodical_material/2.png",
        "link": "https://drive.google.com/file/d/11TV01QKfWRKGvWzhz5sQktMJwGjtPnib/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "У цьому уроці ви змусите ваш симулятор водіння ожити. Спочатку ти будеш напишіть свої перші рядки коду на C #, змінивши положення транспортного засобу та що дозволяє йому рухатися вперед. Далі ви додасте до свого складу компоненти фізики об’єкти, що дозволяє їм стикатися один з одним. Нарешті, ви дізнаєтесь, як дублювати предмети в ієрархії та розміщувати їх уздовж дороги.",
        ]
    },
    {
        "name":  "1.3 Висока швидкість погоні",
        "color": "#212B35",
        "srcImg": "img/methodical_material/3.png",
        "link": "https://drive.google.com/file/d/1dI4zLlvY3Ga1LeXr4SZybtta0TLVelks/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Слідкуй за дорогою! У цьому уроці ти створиш новий C# Script для камери, він дозволить їй слідувати за автомобілем. Для цього тобі доведеться скористатися дуже важливою концепцією в програмуванні, це змінні.",
        ]
    },
    {
        "name":  "1.4 Додай керування",
        "color": "#212B35",
        "srcImg": "img/methodical_material/4.png",
        "link": "https://drive.google.com/file/d/1kx9OMrRR6bItQfI7pNxVTX_1HpIXBoi_/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "На цьому уроці нам потрібно виїхати на дорогу та отримати контроль над автомобілем. Для цього нам потрібно визначити, коли водій натискає клавіші, тоді прискорити і повернути авто на основі цього вхідних даних. Використовуючи нові методи, вектори та змінні, ти дозволиш авто рухатись так, як цього очікує гравець.",
        ]
    },
    {
        "name":  "Завдання 1. Програмування літака",
        "color": "#212B35",
        "srcImg": "img/methodical_material/5.png",
        "link": "https://drive.google.com/file/d/1_Ef5k7qBK0AFyl5PFtIhW9X6iMthkFYZ/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Використовуй навички, які ти отримав на попередніх заняттях, доведеться створювати перешкоди в повітрі. Тобі доведеться отримати вхідні дані з клавіатури, стрілки вгору та вниз відповідатимуть за висоту літака. Також, тобі потрібно налаштувати камеру, щоб вона рухалась разом з літаком.",
        ]
    },
    {
        "name":  "2.1 Позиціонування гравця",
        "color": "#212B35",
        "srcImg": "img/methodical_material/6.png",
        "link": "https://drive.google.com/file/d/12Wr0egjlfQJFnYOEWoDbOCh-WEDO5Qxo/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Ви почнете цей блок із створення нового проекту для вашого другого Prototype. Спочатку вам потрібно обрати головного вигляд персонажа, тварин яких би ви хотіли нагодувати та якою їжею. Ви запрограмуєте гравця на рух з боку в бік, як у Prototype 1,тільки тепер вам знадобляться оператор if, щоб утримати гравця в обмеженнях",
        ]
    },
    {
        "name":  "2.2 Літаюча їжа",
        "color": "#212B35",
        "srcImg": "img/methodical_material/7.png",
        "link": "https://drive.google.com/file/d/1qyo-ZA0_HDWioBLKtzEXAwBeJ_CqoUmh/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "На цьому уроці ви дозволите гравцеві запустити снаряд через сцену. Спочатку ви напишете новий сценарій для відправки снаряда вперед. Далі ви збережете снаряд разом з усіма його сценаріями та властивостями, використовуючи важливу нову концепцію в Unity, яка називається Prefabs. Гравець зможе запустити снаряд, натиснувши пробіл. Нарешті, ви додасте межі сцени, видаляючи будь-які предмети, що залишають екран.",
        ]
    },
    {
        "name":  "2.3 Випадкове розташування тварин",
        "color": "#212B35",
        "srcImg": "img/methodical_material/8.png",
        "link": "https://drive.google.com/file/d/1lPEwllF1IsiG0RG1UUXk6biqQ3msRByP/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Наші звірі ходять по екрану і виходять за межі, але насправді вони не з’являються в грі, якщо ми їх не розташуємо на сцені! На цьому уроці ми дозволимо тваринам самостійно з’являтись у випадковому місці верхньої частини екрану. Для цього ми створимо новий об’єкт і новий сценарій для управління всім процесами префабу.",
        ]
    },
    {
        "name":  "2.4 Game Over",
        "color": "#212B35",
        "srcImg": "img/methodical_material/9.png",
        "link": "https://drive.google.com/file/d/1lTmX8fUCBVZqrJQWLvoXmmhmXbwYTJg-/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Наша гра працює добре, але є кілька важливих нюансів, які ми повинні додати, перш ніж вона закінчиться. По-перше, для тварин ми створемо таймер, щоб вони з’являлися кожні кілька секунд. Далі ми додамо коллайдери до всіх наших префабів і зробимо так, що запуск снаряда в об’єкт знищить його. Вкінці, ми покажемо повідомлення «Game Over», якщо будь-яка істота пройде повз гравця",
        ]
    },
    {
        "name":  "Завдання. 2 Гра з песиком",
        "color": "#212B35",
        "srcImg": "img/methodical_material/10.png",
        "link": "https://drive.google.com/file/d/1fCC00pkxyjTp0yr9qAvmXGqNh28gncg_/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Для програмування використовуйте свої навички створення масивів та випадкових чисел, коли кульки випадковим чином падають з неба, ви повинні відправити собаку, щоб зловити їх, перш ніж вони впадуть на землю. Щоб виконати це завдання, вам доведеться переконатися, що ваші змінні присвоєні належним чином, ваші оператори if запрограмовані правильно, ваші зіткнення працюють добре та об’єкти генеруються випадковим чином.",
        ]
    },
    {
        "name":  "3.1 Потужний стрибок",
        "color": "#212B35",
        "srcImg": "img/methodical_material/11.png",
        "link": "https://drive.google.com/file/d/1s1LXwEuCjpqOhCO28T0D2MrZuTU8F-Jo/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Мета цього уроку - налаштувати основний ігровий процес для цього прототипу. Ми почнемо зі створення нового проекту та імпортування початкових файлів. Далі ми виберемо фон та головного героя, і дозволимо цьому персонажу стрибати за допомогою клавіші пробілу. Ми також виберемо перешкоду для гравця та створимо менеджер створення, який кидатиме їх на шлях гравця через певний проміжок часу."
        ]
    },
    {
        "name":  "3.2 Налаштування сцени",
        "color": "#212B35",
        "srcImg": "img/methodical_material/12.png",
        "link": "https://drive.google.com/file/d/1fL6HaZTAkP5jwPzEeGZ0f5fYtXrA_Kfp/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Ми зрозуміли основну механіку цієї гри: гравець може натиснути пробіл, щоб перестрибнути перешкоди. Фон видно протягом перших декількох секунд, але потім фон просто зникає! Для того, щоб це виправити, нам потрібно повторювати фон. Нам також потрібна зупинка гри, коли гравець стикається з перешкодою, зупинити повторення фону та створення перешкод. Наприкінці, ми повинні знищити будь-які перешкоди, що проходять повз гравця.",
        ]
    },
    {
        "name":  "3.3 Додавання анімації",
        "color": "#212B35",
        "srcImg": "img/methodical_material/13.png",
        "link": "https://drive.google.com/file/d/1IF00xwtnJQcwBMuDyvGOgD9ODieuiIHZ/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Зараз гра виглядає чудово, але рухи гравця трохи ... не живі. Замість того, щоб персонаж просто ковзав по землі, ми дамо йому анімацію для бігу, стрибків і навіть смерті! Ми також налаштуємо швидкість цих анімацій, встановивши їх час, щоб вони виглядали ідеально в ігровому процесі.",
        ]
    },
    {
        "name":  "3.4 Система частинок та звукові ефекти",
        "color": "#212B35",
        "srcImg": "img/methodical_material/14.png",
        "link": "https://drive.google.com/file/d/1_h3EeFeNUlhZ4G6ggaSEB3pQQneXYOsj/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Ця гра виглядає надзвичайно добре, але їй чогось не вистачає: звукових ефектів та ефектів частинок! Звуки та музика вдихнуть життя в безшумний ігровий світ, а частинки зроблять дії гравця більш динамічними та вражаючими. У цьому уроці ми додамо круті звуки та частинки, коли персонаж біжить, стрибає та падає",
        ]
    },
    {
        "name":  "Завдання 3. Повітряна кулька",
        "color": "#212B35",
        "srcImg": "img/methodical_material/15.png",
        "link": "https://drive.google.com/file/d/16uupfAlhToWvVgovV3aeipzzUywVTxFd/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Застосуйте свої знання з фізики, прокрутки фонів та спецефектів до повітряної кулі, що пливе містом, піднімаючи жетони, уникаючи вибухівки. У цьому проекті вам доведеться усунути багато помилок.",
        ]
    },
    {
        "name":  "4.1 Дивіться, куди ви прямуєте",
        "color": "#212B35",
        "srcImg": "img/methodical_material/16.png",
        "link": "https://drive.google.com/file/d/1W5mUknz0v-bkzSzy4MdssnDtebFY9MT6/view?usp=sharing",
        "tegs": [
            "Unity",
            "Інформатика",
        ],
        "content": [
            "Перш за все, ми створимо новий прототип і завантажимо допоміжні файли! Ви познайомитесь з моделлю острова, неба та частинок ... все це можна налаштувати! Далі ви дозволите гравцеві обертати положення камери навколо острова, забезпечуючи чудовий вид сцени. Гравець буде представлений кулею, загорнутою в текстуру на ваш вибір. Наприкінці, ви додасте сили гравцеві, дозволяючи йому рухатися вперед або назад у напрямку камери.",
        ]
    },
    // Unity end

   
    // {
    //     "name":  "",
    //     "color": "#212B35",
    //     "srcImg": "img/methodical_material/6.png",
    //     "link": "",
    //     "tegs": [
    //         "Unity",
    //         "Інформатика",
    //     ],
    //     "content": [
    //         "",
    //     ]
    // },
]